{"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Graph neural networks: A review of methods and applications", "pub_year": 2020, "citation": "AI open 1, 57-81, 2020", "author": "Jie Zhou and Ganqu Cui and Shengding Hu and Zhengyan Zhang and Cheng Yang and Zhiyuan Liu and Lifeng Wang and Changcheng Li and Maosong Sun", "volume": "1", "pages": "57-81", "publisher": "Elsevier", "abstract": "Lots of learning tasks require dealing with graph data which contains rich relation information among elements. Modeling physics systems, learning molecular fingerprints, predicting protein interface, and classifying diseases demand a model to learn from graph inputs. In other domains such as learning from non-structural data like texts and images, reasoning on extracted structures (like the dependency trees of sentences and the scene graphs of images) is an important research topic which also needs graph reasoning models. Graph neural networks (GNNs) are neural models that capture the dependence of graphs via message passing between the nodes of graphs. In recent years, variants of GNNs such as graph convolutional network (GCN), graph attention network (GAT), graph recurrent network (GRN) have demonstrated ground-breaking performances on many deep learning tasks. In this survey, we …"}, "filled": true, "author_pub_id": "OlLjVUcAAAAJ:WF5omc3nYNoC", "num_citations": 4438, "citedby_url": "/scholar?hl=en&cites=2381021153585051804,13474641505560510948,13509830391746063112,12658422006615752882,4693789745680466618", "cites_id": ["2381021153585051804", "13474641505560510948", "13509830391746063112", "12658422006615752882", "4693789745680466618"], "pub_url": "https://www.sciencedirect.com/science/article/pii/S2666651021000012", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:nLggvh8WCyEJ:scholar.google.com/", "cites_per_year": {"2019": 176, "2020": 526, "2021": 927, "2022": 1339, "2023": 1430}}
{"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Network representation learning with rich text information", "pub_year": 2015, "citation": "Twenty-Fourth International Joint Conference on Artificial Intelligence, 2015", "author": "Cheng Yang and Zhiyuan Liu and Deli Zhao and Maosong Sun and Edward Chang", "conference": "Twenty-Fourth International Joint Conference on Artificial Intelligence", "abstract": "Representation learning has shown its effectiveness in many tasks such as image classification and text mining. Network representation learning aims at learning distributed vector representation for each vertex in a network, which is also increasingly recognized as an important aspect for network analysis. Most network representation learning methods investigate network structures for learning. In reality, network vertices contain rich information (such as text), which cannot be well applied with algorithmic frameworks of typical representation learning methods. By proving that DeepWalk, a state-of-the-art network representation method, is actually equivalent to matrix factorization (MF), we propose text-associated DeepWalk (TADW). TADW incorporates text features of vertices into network representation learning under the framework of matrix factorization. We evaluate our method and various baseline methods by applying them to the task of multi-class classification of vertices. The experimental results show that, our method outperforms other baselines on all three datasets, especially when networks are noisy and training ratio is small. The source code of this paper can be obtained from https://github. com/albertyang33/TADW."}, "filled": true, "author_pub_id": "OlLjVUcAAAAJ:u5HHmVD_uO8C", "num_citations": 1265, "citedby_url": "/scholar?hl=en&cites=14010164510536911933", "cites_id": ["14010164510536911933"], "pub_url": "https://nlp.csai.tsinghua.edu.cn/~lzy/publications/ijcai2015_network.pdf", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:PUxWr2QabsIJ:scholar.google.com/", "cites_per_year": {"2016": 15, "2017": 64, "2018": 146, "2019": 230, "2020": 241, "2021": 217, "2022": 193, "2023": 148}}
{"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "GEAR: Graph-based Evidence Aggregating and Reasoning for Fact Verification", "pub_year": 2019, "citation": "arXiv preprint arXiv:1908.01843, 2019", "author": "Jie Zhou and Xu Han and Cheng Yang and Zhiyuan Liu and Lifeng Wang and Changcheng Li and Maosong Sun", "journal": "arXiv preprint arXiv:1908.01843", "abstract": "Fact verification (FV) is a challenging task which requires to retrieve relevant evidence from plain text and use the evidence to verify given claims. Many claims require to simultaneously integrate and reason over several pieces of evidence for verification. However, previous work employs simple models to extract information from evidence without letting evidence communicate with each other, e.g., merely concatenate the evidence for processing. Therefore, these methods are unable to grasp sufficient relational and logical information among the evidence. To alleviate this issue, we propose a graph-based evidence aggregating and reasoning (GEAR) framework which enables information to transfer on a fully-connected evidence graph and then utilizes different aggregators to collect multi-evidence information. We further employ BERT, an effective pre-trained language representation model, to improve the performance. Experimental results on a large-scale benchmark dataset FEVER have demonstrated that GEAR could leverage multi-evidence information for FV and thus achieves the promising result with a test FEVER score of 67.10%. Our code is available at https://github.com/thunlp/GEAR."}, "filled": true, "author_pub_id": "OlLjVUcAAAAJ:ULOm3_A8WrAC", "num_citations": 178, "citedby_url": "/scholar?hl=en&cites=12000475385343098199", "cites_id": ["12000475385343098199"], "pub_url": "https://arxiv.org/abs/1908.01843", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:V70xH8hAiqYJ:scholar.google.com/", "cites_per_year": {"2019": 3, "2020": 28, "2021": 61, "2022": 48, "2023": 37}}
{"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Fast network embedding enhancement via high order proximity approximation.", "pub_year": 2017, "citation": "IJCAI, 3894-3900, 2017", "author": "Cheng Yang and Maosong Sun and Zhiyuan Liu and Cunchao Tu", "conference": "IJCAI", "pages": "3894-3900", "abstract": "Many Network Representation Learning (NRL) methods have been proposed to learn vector representations for vertices in a network recently. In this paper, we summarize most existing NRL methods into a unified two-step framework, including proximity matrix construction and dimension reduction. We focus on the analysis of proximity matrix construction step and conclude that an NRL method can be improved by exploring higher order proximities when building the proximity matrix. We propose Network Embedding Update (NEU) algorithm which implicitly approximates higher order proximities with theoretical approximation bound and can be applied on any NRL methods to enhance their performances. We conduct experiments on multi-label classification and link prediction tasks. Experimental results show that NEU can make a consistent and significant improvement over a number of NRL methods with almost negligible running time on all three publicly available datasets. The source code of this paper can be obtained from https://github. com/thunlp/NEU."}, "filled": true, "author_pub_id": "OlLjVUcAAAAJ:2osOgNQ5qMEC", "num_citations": 172, "citedby_url": "/scholar?hl=en&cites=7477427761261944508", "cites_id": ["7477427761261944508"], "pub_url": "http://www.shichuan.org/hin/topic/Embedding/2017.%20IJCAI2017%20Fast%20Network%20Embedding%20Enhancement%20via%20High%20Order%20Proximity%20Approximation.pdf", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:vJ6ph-4oxWcJ:scholar.google.com/", "cites_per_year": {"2017": 2, "2018": 28, "2019": 36, "2020": 38, "2021": 32, "2022": 20, "2023": 15}}
{"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "A neural network approach to jointly modeling social networks and mobile trajectories", "pub_year": 2017, "citation": "ACM Transactions on Information Systems (TOIS) 35 (4), 1-28, 2017", "author": "Cheng Yang and Maosong Sun and Wayne Xin Zhao and Zhiyuan Liu and Edward Y Chang", "journal": "ACM Transactions on Information Systems (TOIS)", "volume": "35", "number": "4", "pages": "1-28", "publisher": "ACM", "abstract": "Two characteristics of location-based services are mobile trajectories and the ability to facilitate social networking. The recording of trajectory data contributes valuable resources towards understanding users’ geographical movement behaviors. Social networking is possible when users are able to quickly connect to anyone nearby. A social network with location based services is known as location-based social network (LBSN). As shown in Cho et al. [2013], locations that are frequently visited by socially related persons tend to be correlated, which indicates the close association between social connections and trajectory behaviors of users in LBSNs. To better analyze and mine LBSN data, we need to have a comprehensive view of each of these two aspects, i.e., the mobile trajectory data and the social network.Specifically, we present a novel neural network model that can jointly model both social networks and …"}, "filled": true, "author_pub_id": "OlLjVUcAAAAJ:qjMakFHDy7sC", "num_citations": 166, "citedby_url": "/scholar?hl=en&cites=12376156624378689440,14536793598128376366", "cites_id": ["12376156624378689440", "14536793598128376366"], "pub_url": "https://dl.acm.org/doi/abs/10.1145/3041658", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:oHew0ODwwKsJ:scholar.google.com/", "cites_per_year": {"2016": 3, "2017": 2, "2018": 19, "2019": 32, "2020": 38, "2021": 24, "2022": 21, "2023": 27}}
{"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Adaptive graph encoder for attributed graph embedding", "pub_year": 2020, "citation": "Proceedings of the 26th ACM SIGKDD international conference on knowledge …, 2020", "author": "Ganqu Cui and Jie Zhou and Cheng Yang and Zhiyuan Liu", "pages": "976-985", "abstract": "Attributed graph embedding, which learns vector representations from graph topology and node features, is a challenging task for graph analysis. Recently, methods based on graph convolutional networks (GCNs) have made great progress on this task. However,existing GCN-based methods have three major drawbacks. Firstly,our experiments indicate that the entanglement of graph convolutional filters and weight matrices will harm both the performance and robustness. Secondly, we show that graph convolutional filters in these methods reveal to be special cases of generalized Laplacian smoothing filters, but they do not preserve optimal low-pass characteristics. Finally, the training objectives of existing algorithms are usually recovering the adjacency matrix or feature matrix, which are not always consistent with real-world applications. To address these issues, we propose Adaptive Graph Encoder (AGE), a …"}, "filled": true, "author_pub_id": "OlLjVUcAAAAJ:-f6ydRqryjwC", "num_citations": 161, "citedby_url": "/scholar?hl=en&cites=6150478412876762229", "cites_id": ["6150478412876762229"], "pub_url": "https://dl.acm.org/doi/abs/10.1145/3394486.3403140", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:dUw6pofjWlUJ:scholar.google.com/", "cites_per_year": {"2020": 3, "2021": 24, "2022": 48, "2023": 86}}
{"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Graph neural news recommendation with long-term and short-term interest modeling", "pub_year": 2020, "citation": "Information Processing & Management 57 (2), 102142, 2020", "author": "Linmei Hu and Chen Li and Chuan Shi and Cheng Yang and Chao Shao", "journal": "Information Processing & Management", "volume": "57", "number": "2", "pages": "102142", "publisher": "Pergamon", "abstract": "With the information explosion of news articles, personalized news recommendation has become important for users to quickly find news that they are interested in. Existing methods on news recommendation mainly include collaborative filtering methods which rely on direct user-item interactions and content based methods which characterize the content of user reading history. Although these methods have achieved good performances, they still suffer from data sparse problem, since most of them fail to extensively exploit high-order structure information (similar users tend to read similar news articles) in news recommendation systems. In this paper, we propose to build a heterogeneous graph to explicitly model the interactions among users, news and latent topics. The incorporated topic information would help indicate a user’s interest and alleviate the sparsity of user-item interactions. Then we take advantage of …"}, "filled": true, "author_pub_id": "OlLjVUcAAAAJ:Wp0gIr-vW9MC", "num_citations": 161, "citedby_url": "/scholar?hl=en&cites=4408706398956056563", "cites_id": ["4408706398956056563"], "pub_url": "https://www.sciencedirect.com/science/article/pii/S0306457319307800", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:82_EjBzfLj0J:scholar.google.com/", "cites_per_year": {"2020": 9, "2021": 38, "2022": 57, "2023": 57}}
{"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Graph neural news recommendation with unsupervised preference disentanglement", "pub_year": 2020, "citation": "Proceedings of the 58th annual meeting of the association for computational …, 2020", "author": "Linmei Hu and Siyong Xu and Chen Li and Cheng Yang and Chuan Shi and Nan Duan and Xing Xie and Ming Zhou", "conference": "Proceedings of the 58th annual meeting of the association for computational linguistics", "pages": "4255-4264", "abstract": "With the explosion of news information, personalized news recommendation has become very important for users to quickly find their interested contents. Most existing methods usually learn the representations of users and news from news contents for recommendation. However, they seldom consider high-order connectivity underlying the user-news interactions. Moreover, existing methods failed to disentangle a user’s latent preference factors which cause her clicks on different news. In this paper, we model the user-news interactions as a bipartite graph and propose a novel Graph Neural News Recommendation model with Unsupervised Preference Disentanglement, named GNUD. Our model can encode high-order relationships into user and news representations by information propagation along the graph. Furthermore, the learned representations are disentangled with latent preference factors by a neighborhood routing algorithm, which can enhance expressiveness and interpretability. A preference regularizer is also designed to force each disentangled subspace to independently reflect an isolated preference, improving the quality of the disentangled representations. Experimental results on real-world news datasets demonstrate that our proposed model can effectively improve the performance of news recommendation and outperform state-of-the-art news recommendation methods."}, "filled": true, "author_pub_id": "OlLjVUcAAAAJ:hC7cP41nSMkC", "num_citations": 121, "citedby_url": "/scholar?hl=en&cites=16822645179995048586", "cites_id": ["16822645179995048586"], "pub_url": "https://aclanthology.org/2020.acl-main.392/", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:isoKOKkKdukJ:scholar.google.com/", "cites_per_year": {"2019": 1, "2020": 4, "2021": 29, "2022": 43, "2023": 44}}
{"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "CED: credible early detection of social media rumors", "pub_year": 2019, "citation": "IEEE Transactions on Knowledge and Data Engineering 33 (8), 3035-3047, 2019", "author": "Changhe Song and Cheng Yang and Huimin Chen and Cunchao Tu and Zhiyuan Liu and Maosong Sun", "journal": "IEEE Transactions on Knowledge and Data Engineering", "volume": "33", "number": "8", "pages": "3035-3047", "publisher": "IEEE", "abstract": "Rumors spread dramatically fast through online social media services, and people are exploring methods to detect rumors automatically. Existing methods typically learn semantic representations of all reposts to a rumor candidate for prediction. However, it is crucial to efficiently detect rumors as early as possible before they cause severe social disruption, which has not been well addressed by previous works. In this paper, we present a novel early rumor detection model, Credible Early Detection (CED). By regarding all reposts to a rumor candidate as a sequence, the proposed model will seek an early point-in-time for making a credible prediction. We conduct experiments on three real-world datasets, and the results demonstrate that our proposed model can remarkably reduce the time span for prediction by more than 85 percent, with better accuracy performance than all state-of-the-art baselines."}, "filled": true, "author_pub_id": "OlLjVUcAAAAJ:W7OEmFMy1HYC", "num_citations": 107, "citedby_url": "/scholar?hl=en&cites=18088836127281551113", "cites_id": ["18088836127281551113"], "pub_url": "https://ieeexplore.ieee.org/abstract/document/8939421/", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:CZfedp50CPsJ:scholar.google.com/", "cites_per_year": {"2019": 6, "2020": 9, "2021": 21, "2022": 32, "2023": 38}}
{"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Full-Scale Information Diffusion Prediction With Reinforced Recurrent Networks", "pub_year": 2021, "citation": "IEEE Transactions on Neural Networks and Learning Systems, 2021", "author": "Cheng Yang and Hao Wang and Jian Tang and Chuan Shi and Maosong Sun and Ganqu Cui and Zhiyuan Liu", "journal": "IEEE Transactions on Neural Networks and Learning Systems", "publisher": "IEEE", "abstract": "Information diffusion prediction is an important task, which studies how information items spread among users. With the success of deep learning techniques, recurrent neural networks (RNNs) have shown their powerful capability in modeling information diffusion as sequential data. However, previous works focused on either microscopic diffusion prediction, which aims at guessing who will be the next influenced user at what time, or macroscopic diffusion prediction, which estimates the total numbers of influenced users during the diffusion process. To the best of our knowledge, few attempts have been made to suggest a unified model for both microscopic and macroscopic scales. In this article, we propose a novel full-scale diffusion prediction model based on reinforcement learning (RL). RL incorporates the macroscopic diffusion size information into the RNN-based microscopic diffusion model by addressing the …"}, "filled": true, "author_pub_id": "OlLjVUcAAAAJ:JV2RwH3_ST0C", "num_citations": 91, "citedby_url": "/scholar?hl=en&cites=91641297332298551", "cites_id": ["91641297332298551"], "pub_url": "https://ieeexplore.ieee.org/abstract/document/9526884/", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:N2M_PkaTRQEJ:scholar.google.com/", "cites_per_year": {"2020": 11, "2021": 22, "2022": 23, "2023": 34}}
